Revit 2027 API
ViewSheet.GetAllPlacedViews Method
 Returns the ElementIds of Views placed on this sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAllPlacedViews()
Public Function GetAllPlacedViews As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAllPlacedViews()
member GetAllPlacedViews : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The ids of the views on this sheet.
Remarks
 Schedules on the sheet are not returned by this method. Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace